# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'homebrew/cask' || true

brew 'tree'
brew 'python3'
brew 'pipenv'
brew 'curl'
brew 'coreutils'
brew 'openssl'
brew 'stow'
brew 'git'
brew 'bash-completion'
brew 'vim'
brew 'shellcheck'
brew 'neofetch'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'bash'
brew 'the_silver_searcher'
brew 'terraform'
brew 'terragrunt'
brew 'go'

# Casks
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'spotify'
cask 'bettertouchtool'
cask 'fantastical'
cask 'slack'
cask 'bitwarden'
cask 'visual-studio-code'
cask 'notion'
cask 'microsoft-remote-desktop'
cask 'docker'
