# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'homebrew/cask' || true
tap 'hashicorp/tap' || true

brew 'tree'
brew 'jq'
brew 'coreutils'
brew 'openssl'
brew 'stow'
brew 'git'
brew 'bash-completion'
brew 'vim'
brew 'shellcheck'
brew 'fastfetch'
brew 'bash'
brew 'the_silver_searcher'
brew 'rg'
brew 'telnet'
brew 'ipcalc'
brew 'hashicorp/tap/terraform'
brew 'kubernetes-cli'
brew 'minikube'
brew 'yq'

# Casks
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'spotify'
cask 'bettertouchtool'
cask 'fantastical'
cask 'slack'
cask 'bitwarden'
cask 'visual-studio-code'
cask 'notion'
cask 'microsoft-remote-desktop'
cask 'docker'
