# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'caskroom/homebrew-cask' || true

brew 'tree'
brew 'python3'
brew 'pipenv'
brew 'curl'
brew 'coreutils'
brew 'openssl'
brew 'stow'
brew 'git'
brew 'bash-completion'
brew 'kubernetes-cli'
brew 'vim'
brew 'shellcheck'
brew 'neofetch'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Casks
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'spotify'
